# Описание проекта

Перейдём к задаче. HR-аналитики компании «Работа с заботой» помогают бизнесу оптимизировать управление персоналом: бизнес предоставляет данные, а аналитики предлагают, как избежать финансовых потерь и оттока сотрудников. В этом HR-аналитикам пригодится машинное обучение, с помощью которого получится быстрее и точнее отвечать на вопросы бизнеса.

У вас будет несколько задач. Первая — построить модель, которая сможет предсказать уровень удовлетворённости сотрудника на основе данных заказчика. 
Почему бизнесу это важно: удовлетворённость работой напрямую влияет на отток сотрудников. А предсказание оттока — одна из важнейших задач HR-аналитиков. Внезапные увольнения несут в себе риски для компании, особенно если уходит важный сотрудник.

Ваша вторая задача — построить модель, которая сможет на основе данных заказчика предсказать то, что сотрудник уволится из компании.
Теперь расскажем подробнее о задачах.

Для этой задачи заказчик предоставил данные с признаками:
- id — уникальный идентификатор сотрудника;
- dept — отдел, в котором работает сотрудник;
- level — уровень занимаемой должности;
- workload — уровень загруженности сотрудника;
- employment_years — длительность работы в компании (в годах);
- last_year_promo — показывает, было ли повышение за последний год;
- last_year_violations — показывает, нарушал ли сотрудник трудовой договор за последний год;
- supervisor_evaluation — оценка качества работы сотрудника, которую дал руководитель;
- salary — ежемесячная зарплата сотрудника;
- job_satisfaction_rate — уровень удовлетворённости сотрудника работой в компании, целевой признак.

# Загрузка данных

Загрузка и подключение нужных библиотек

In [84]:
import pandas as pd
import numpy as np

Загрузка датафреймов

In [43]:
test_features=pd.read_csv('./test_features.csv')

In [4]:
test_target_job_satisfaction_rate=pd.read_csv('./test_target_job_satisfaction_rate.csv')

In [5]:
test_target_quit=pd.read_csv('./test_target_quit.csv')

In [6]:
train_job_satisfaction_rate=pd.read_csv('./train_job_satisfaction_rate.csv')

In [7]:
train_quit=pd.read_csv('./train_quit.csv')

# Предобработка данных

## test_features

Информазия о датафрейме

In [10]:
test_features.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     2000 non-null   int64
 1   dept                   1998 non-null   object
 2   level                  1999 non-null   object
 3   workload               2000 non-null   object
 4   employment_years       2000 non-null   int64
 5   last_year_promo        2000 non-null   object
 6   last_year_violations   2000 non-null   object
 7   supervisor_evaluation  2000 non-null   int64
 8   salary                 2000 non-null   int64
dtypes: int64(4), object(5)
memory usage: 140.8+ KB

Просмотр первых строк

In [9]:
test_features.head()

,id,dept,level,workload,employment_years,last_year_promo,last_year_violations,supervisor_evaluation,salary
0,485046,marketing,junior,medium,2,no,no,5,28800
1,686555,hr,junior,medium,1,no,no,4,30000
2,467458,sales,middle,low,5,no,no,4,19200
3,418655,sales,middle,low,6,no,no,4,19200
4,789145,hr,middle,medium,5,no,no,5,40800

Количество пропусков в данных

In [26]:
test_features.isnull().sum()

id                       0
dept                     2
level                    1
workload                 0
employment_years         0
last_year_promo          0
last_year_violations     0
supervisor_evaluation    0
salary                   0
dtype: int64

Вывод строк с пропусками по столбцу 'dept'

In [12]:
test_features[test_features['dept'].isnull()]

,id,dept,level,workload,employment_years,last_year_promo,last_year_violations,supervisor_evaluation,salary
191,609865,NaN,junior,medium,1,no,no,1,20400
1196,832342,NaN,junior,medium,1,no,no,4,28800

Вывод строк с пропусками по столбцу 'level'

In [13]:
test_features[test_features['level'].isnull()]

,id,dept,level,workload,employment_years,last_year_promo,last_year_violations,supervisor_evaluation,salary
312,471990,sales,NaN,low,1,no,no,3,12000

Поиск явных дубликатов

In [14]:
test_features.duplicated().sum()

0

Поиск неявных дубликатов плюс создание списка с категориальными признаками для дальнейшего анализа

In [89]:
test_features_categor=[]
for column in test_features.select_dtypes(include=['object']):
    print(column, test_features[column].unique())
    test_features_categor.append(column)

dept ['marketing' 'hr' 'sales' 'purchasing' 'technology' nan]
level ['junior' 'middle' 'sinior' nan]
workload ['medium' 'low' 'high' nan]
last_year_promo ['no' 'yes']
last_year_violations ['no' 'yes']

Обнаружены аномальные значение в столбцах 'workload' и 'dept' . Выведем их

In [18]:
test_features[test_features['workload']==' ']

,id,dept,level,workload,employment_years,last_year_promo,last_year_violations,supervisor_evaluation,salary
15,590867,marketing,junior,,4,no,no,4,28800

In [19]:
test_features[test_features['dept']==' ']

,id,dept,level,workload,employment_years,last_year_promo,last_year_violations,supervisor_evaluation,salary
1699,822186,,middle,medium,3,no,no,4,38400

Замена всех пробелов на nan

In [85]:
test_features=test_features.replace(r'^\s*$', np.nan, regex=True)

Проверка результатов

In [86]:
test_features[test_features['dept']==' ']

Empty DataFrame
Columns: [id, dept, level, workload, employment_years, last_year_promo, last_year_violations, supervisor_evaluation, salary]
Index: []

In [87]:
test_features[test_features['workload']==' ']

Empty DataFrame
Columns: [id, dept, level, workload, employment_years, last_year_promo, last_year_violations, supervisor_evaluation, salary]
Index: []

In [90]:
test_features.isnull().sum()

id                       0
dept                     3
level                    1
workload                 1
employment_years         0
last_year_promo          0
last_year_violations     0
supervisor_evaluation    0
salary                   0
dtype: int64

## test_target_job_satisfaction_rate

Информация о датафрейме

In [20]:
test_target_job_satisfaction_rate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 2 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     2000 non-null   int64
 1   job_satisfaction_rate  2000 non-null   float64
dtypes: float64(1), int64(1)
memory usage: 31.4 KB

Просмотр первых строк

In [49]:
test_target_job_satisfaction_rate.head()

       id  job_satisfaction_rate
0  130604                   0.74
1  825977                   0.75
2  418490                   0.60
3  555320                   0.72
4  826430                   0.08

Поиск пропусков

In [25]:
test_target_job_satisfaction_rate.isnull().sum()

id                       0
job_satisfaction_rate    0
dtype: int64

Поиск дубликатов

In [27]:
test_target_job_satisfaction_rate.duplicated().sum()

0

## test_target_quit

Информация о датафрейме

In [28]:
test_target_quit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      2000 non-null   int64
 1   quit    2000 non-null   object
dtypes: int64(1), object(1)
memory usage: 31.4+ KB

Просмотр первых строк

In [45]:
test_target_quit.head()

       id quit
0  999029  yes
1  372846   no
2  726767   no
3  490105   no
4  416898  yes

Поиск пропусков

In [29]:
test_target_quit.isnull().sum()

id      0
quit    0
dtype: int64

Поиск дубликатов

In [30]:
test_target_quit.duplicated().sum()

0

Проверка на случай неявных дубликатов

In [31]:
test_target_quit['quit'].unique()

array(['yes', 'no'], dtype=object)

## train_job_satisfaction_rate

Информация о датафрейме

In [32]:
train_job_satisfaction_rate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     4000 non-null   int64
 1   dept                   3994 non-null   object
 2   level                  3996 non-null   object
 3   workload               4000 non-null   object
 4   employment_years       4000 non-null   int64
 5   last_year_promo        4000 non-null   object
 6   last_year_violations   4000 non-null   object
 7   supervisor_evaluation  4000 non-null   int64
 8   salary                 4000 non-null   int64
 9   job_satisfaction_rate  4000 non-null   float64
dtypes: float64(1), int64(4), object(5)
memory usage: 312.6+ KB

Просмотр первых строк

In [46]:
test_target_quit.head()

       id quit
0  999029  yes
1  372846   no
2  726767   no
3  490105   no
4  416898  yes

Поиск пропусков

In [33]:
train_job_satisfaction_rate.isnull().sum()

id                       0
dept                     6
level                    4
workload                 0
employment_years         0
last_year_promo          0
last_year_violations     0
supervisor_evaluation    0
salary                   0
job_satisfaction_rate    0
dtype: int64

Вывод строк с пропусками по столбикам 'dept' и 'level'

In [35]:
train_job_satisfaction_rate[train_job_satisfaction_rate['dept'].isnull()]

,id,dept,level,workload,employment_years,last_year_promo,last_year_violations,supervisor_evaluation,salary,job_satisfaction_rate
1526,694746,NaN,junior,medium,5,no,no,4,21600,0.62
1630,814624,NaN,junior,medium,3,no,no,4,24000,0.88
1633,475114,NaN,junior,high,4,no,no,4,31200,0.63
2781,497243,NaN,junior,medium,1,no,no,3,26400,0.28
2975,168668,NaN,junior,low,3,no,no,4,18000,0.88
3866,641150,NaN,junior,low,3,no,yes,4,12000,0.54

In [36]:
train_job_satisfaction_rate[train_job_satisfaction_rate['level'].isnull()]

,id,dept,level,workload,employment_years,last_year_promo,last_year_violations,supervisor_evaluation,salary,job_satisfaction_rate
1209,631073,sales,NaN,medium,1,no,no,4,27600,0.66
1469,416327,sales,NaN,low,1,no,no,5,18000,0.73
1745,135043,sales,NaN,medium,1,no,no,3,26400,0.30
2522,998838,sales,NaN,medium,1,no,no,5,27600,0.71

Поиск дубликатов

In [37]:
train_job_satisfaction_rate.duplicated().sum()

0

Поиск неявных дубликатов плюс создание списка категориальных признаков для дальнейшего анализа

In [77]:
train_job_satisfaction_rate_categor=[]
for column in train_job_satisfaction_rate.select_dtypes(include=['object']):
    print(column, train_job_satisfaction_rate[column].unique())
    train_job_satisfaction_rate_categor.append(column)

dept ['sales' 'hr' 'technology' 'purchasing' 'marketing' nan]
level ['junior' 'middle' 'sinior' nan]
workload ['medium' 'high' 'low']
last_year_promo ['no' 'yes']
last_year_violations ['no' 'yes']

## train_quit

Просмотр информации о датафрейме

In [39]:
train_quit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     4000 non-null   int64
 1   dept                   4000 non-null   object
 2   level                  4000 non-null   object
 3   workload               4000 non-null   object
 4   employment_years       4000 non-null   int64
 5   last_year_promo        4000 non-null   object
 6   last_year_violations   4000 non-null   object
 7   supervisor_evaluation  4000 non-null   int64
 8   salary                 4000 non-null   int64
 9   quit                   4000 non-null   object
dtypes: int64(4), object(6)
memory usage: 312.6+ KB

Вывод первых строк

In [47]:
train_quit.head()

,id,dept,level,workload,employment_years,last_year_promo,last_year_violations,supervisor_evaluation,salary,quit
0,723290,sales,middle,high,2,no,no,4,54000,no
1,814010,sales,junior,medium,2,no,no,4,27600,no
2,155091,purchasing,middle,medium,5,no,no,1,37200,no
3,257132,sales,junior,medium,2,no,yes,3,24000,yes
4,910140,marketing,junior,medium,2,no,no,5,25200,no

Поиск пропусков

In [40]:
train_quit.isnull().sum()

id                       0
dept                     0
level                    0
workload                 0
employment_years         0
last_year_promo          0
last_year_violations     0
supervisor_evaluation    0
salary                   0
quit                     0
dtype: int64

Поиск дубликатов

In [41]:
train_quit.duplicated().sum()

0

Поиск неявных дубликатов плюс создание списка с категориальными признаками для дальнейшего анализа

In [75]:
train_quit_categor=[]
for column in train_quit.select_dtypes(include=['object']):
    print(column, train_quit[column].unique())
    train_quit_categor.append(column)

dept ['sales' 'purchasing' 'marketing' 'technology' 'hr']
level ['middle' 'junior' 'sinior']
workload ['high' 'medium' 'low']
last_year_promo ['no' 'yes']
last_year_violations ['no' 'yes']
quit ['no' 'yes']

<b>Вывод:</b>

1) test_features
  - В данных были обнаружены пропуски в столбцах 'dept' и 'level'
  - Были обнаружены пустые значения в столбцах 'workload' и 'dept'
  - Остально все нормально, неявных пропусков не обнаружено, названия столбцов в змеином регистре, типы данных присвоены правильно
    
2) test_target_job_satisfaction_rate
  - Проблем не обнаружено
    
3) test_target_quit
  - Проблем не обнаружено
    
4) train_job_satisfaction_rate
  - В данных были обнаружены пропуски в столбцах 'dept' и 'level'
    
5) train_quit
  - Проблем не обнаружено
    
6) Везде был замечен нюанс sinior очень странно написан, но я решил не трогать вдруг так и надо

# Исследовательский анализ данных

Далее будем использовать только 
- train_job_satisfaction_rate
- test_features
- test_target_job_satisfaction_rate

## train_job_satisfaction_rate

In [58]:
train_job_satisfaction_rate.head()

,id,dept,level,workload,employment_years,last_year_promo,last_year_violations,supervisor_evaluation,salary,job_satisfaction_rate
0,155278,sales,junior,medium,2,no,no,1,24000,0.58
1,653870,hr,junior,high,2,no,no,5,38400,0.76
2,184592,sales,junior,low,1,no,no,2,12000,0.11
3,171431,technology,junior,low,4,no,no,2,18000,0.37
4,693419,hr,junior,medium,1,no,no,3,22800,0.20

In [78]:
train_job_satisfaction_rate_num=[]
for column in train_job_satisfaction_rate.select_dtypes(include=['int', 'float']):
    train_job_satisfaction_rate_num.append(column)
train_job_satisfaction_rate_num.remove('id')
train_job_satisfaction_rate_num

['employment_years',
 'supervisor_evaluation',
 'salary',
 'job_satisfaction_rate']

In [79]:
test_features.head()

,id,dept,level,workload,employment_years,last_year_promo,last_year_violations,supervisor_evaluation,salary
0,485046,marketing,junior,medium,2,no,no,5,28800
1,686555,hr,junior,medium,1,no,no,4,30000
2,467458,sales,middle,low,5,no,no,4,19200
3,418655,sales,middle,low,6,no,no,4,19200
4,789145,hr,middle,medium,5,no,no,5,40800